#Множество set
a = set{}#Пустое множество
d = set()#Пустое множество
c = frozenset()#Пустое неизвестное множество
a = {1,1.1,'a',(1,1.1),None,True,print}#Множество, в котором:целое;вещественное;строковое;кортреж;пустой тип;булеровый тип;ВСТРОЕННАЯ ФУНКЦИЯ
a = {1,1.1,[1,2]}#Обмануть встроенные проверки добавлением списка в кортеж не получится, возникнет ошибка
a = frozenset({1,1.1})#Так создается неизменяемое множество
a = [1,'abc',1]#Раньше я был списком
set(a)
b = set('слово')
c = frozenset('hello')
d = set([1,[2.1],1])#Ошибка, внутри есть изменяемый тип
a = {1,1.1,'a'}
a[0] ='a' #Ошибка
a = {1,2,3}
a = {1,1.1,'a'}
del a[0]#Ошибка
del a#Полное удаление переменной 'а'
a = {1,2,3}
b = {3,5,6}
c =a-b
print(c)#{1,2} т.к. из 1,2,3 только 1 и 2 нет во множестве "b"
a-=b
a ={1,1.1,'a'}
a.add('привет')
b = 1
a.add(b)
a ={1,2,3}
a.update({5,2})
help(set)
a ={1,2,3}
a.copy()
a.isdisjoint({4,5,6})
a.issubset({4,3,1,2})
a.issuperset({2,1})
a = frozenset({1,2,3})
a.copy()
a = {'сыр','помидор','молоко'}
b = {'яблоко','хлеб','молоко'}
a.intersection_update(b)
a = {'сыр','помидор','молоко'}
b = {'яблоко','хлеб','молоко'}
a.union(b)
a.union_update(b)
a = {'сыр','помидор','молоко'}
b = {'яблоко','хлеб','молоко'}
a.difference(b)
a.difference_update(b)
a = {'сыр','помидор','молоко'}
b = {'яблоко','хлеб','молоко'}
a.symmetric_difference(b)
a.symmetric_difference_update(b)
a = {'сыр','помидор','молоко'}
b = {'яблоко','хлеб','молоко'}
c = {'колбаса','огурец','молоко'}
a_b = a.intersection(c)
c.difference(b).difference(a)
c.difference(b.union(a))
#Кортеж tuple
a = [1,2.1,3]#Раньше был списком
tuple(a)
b = tuple('abc')#('a','b','c')
a =(1,1.1,'a')
print(a)
print((1,1.1,'a'))
a = (1,1.1,'a')
a =[0]
a =[1]
a =[2]
a =[3]#Ошибка
a =[-1]
a =[-2]
a =[-3]
a =[-4]#Ошибка
a = (1,2,3)
b = (4,5,6)
c = a+b
print(c)
a += b
a = (1,2,3)
b = (4,5,6)
c = a+b
print(c)
a *= b
a = (1,2,3)#Одномерный чертеж
b = ((1,2,3),(4,5,6),(7,8,9))#Двухмерный чертеж
b[0]
b[0][0]
b[-1][-1]
help(tuple)
a =(1,2.1)
a.count(1)
a.index(2)
a = (1,2,[1,2,3])
a[2][0] = 10
a =[1,2,3]
b = (1,2,a)
a[1] = 20
print(b)
#Словарь dict


